<a href="https://colab.research.google.com/github/ludawg44/jigsawlabs/blob/master/31Mar20_5_pivots_lab.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Pivot Tables

### Introduction

In this lesson, we'll get some practice working with pivot tables in pandas.  Whereas groupby is good for grouping our data by one dimension, pivot tables can be useful when grouping our data by multiple dimensions.  

We'll practice using data in this lab from using education data from NYC.

### Loading our Data

Let's begin by loading up our data.

In [0]:
import pandas as pd

In [0]:
url = "https://raw.githubusercontent.com/jigsawlabs-student/exploring-pandas/master/regents-results.csv"
regents_df = pd.read_csv(url)

In [0]:
regents_df[:3]

,Unnamed Column,School DBN,School Name,School Type,School Level,Regents Exam,Year,Category,Total Tested,Mean Score,Number Scoring Below 65,Percent Scoring Below 65,Number Scoring 65 or Above,Percent Scoring 65 or Above,Number Scoring 80 or Above,Percent Scoring 80 or Above,Number Scoring CR,Percent Scoring CR
0,01M0342015All StudentsLiving Environment,01M034,P.S. 034 Franklin D. Roosevelt,General Academic,K-8,Living Environment,2015,All Students,16,77.9,1,6.3,15,93.8,7,43.8,na,na
1,01M0342016All StudentsLiving Environment,01M034,P.S. 034 Franklin D. Roosevelt,General Academic,K-8,Living Environment,2016,All Students,9,74.0,1,11.1,8,88.9,2,22.2,na,na
2,01M0342017All StudentsCommon Core Algebra,01M034,P.S. 034 Franklin D. Roosevelt,General Academic,K-8,Common Core Algebra,2017,All Students,4,s,s,s,s,s,s,s,s,s

As we can see, there is a good amount of categorical data in these columns.  This could be a good candidate for grouping by multiple columns.  But to begin with, let's reduce some of our data.

In [0]:
regents_df.columns

Index(['Unnamed Column', 'School DBN', 'School Name', 'School Type',
       'School Level', 'Regents Exam', 'Year', 'Category', 'Total Tested',
       'Mean Score', 'Number Scoring Below 65', 'Percent Scoring Below 65',
       'Number Scoring 65 or Above', 'Percent Scoring 65 or Above',
       'Number Scoring 80 or Above', 'Percent Scoring 80 or Above',
       'Number Scoring CR', 'Percent Scoring CR'],
      dtype='object')

In [0]:
selected_cols = ['School DBN', 'School Name', 'School Level', 'Regents Exam', 'Year', 'Total Tested', 'Mean Score', 'Percent Scoring 80 or Above', 'Percent Scoring Below 65']

In [0]:
reduced_df = regents_df[selected_cols]

In [0]:
reduced_df[:3]

,School DBN,School Name,School Level,Regents Exam,Year,Total Tested,Mean Score,Percent Scoring 80 or Above,Percent Scoring Below 65
0,01M034,P.S. 034 Franklin D. Roosevelt,K-8,Living Environment,2015,16,77.9,43.8,6.3
1,01M034,P.S. 034 Franklin D. Roosevelt,K-8,Living Environment,2016,9,74.0,22.2,11.1
2,01M034,P.S. 034 Franklin D. Roosevelt,K-8,Common Core Algebra,2017,4,s,s,s

### Querying our Data

Ok, let's begin by looking at the different school levels in our dataset, and the related counts of each.

In [0]:
# Write code here

# High school                        22456
# Secondary School                    4766
# Junior High-Intermediate-Middle     2900
# K-12 all grades                     1516
# K-8                                 1374
# Elementary                            17
# Ungraded                               2

Let's only select High school data.

In [0]:
high_school_df = None

In [0]:
high_school_df.shape

# (22456, 8)

(22456, 9)

Now each school may have had many different tests per year.

In [0]:
high_school_df[:3]

# 	School DBN	School Name	School Level	Regents Exam	Year	Total Tested	Mean Score	Percent Scoring 80 or Above	Percent Scoring Below 65
# 32	01M292	Orchard Collegiate Academy	High school	Algebra2/Trigonometry	2015	5	s	s	s
# 33	01M292	Orchard Collegiate Academy	High school	Chinese	2015	1	s	s	s
# 34	01M292	Orchard Collegiate Academy	High school	Common Core Algebra	2015	12	52.3	0.0	91.7

,School DBN,School Name,School Level,Regents Exam,Year,Total Tested,Mean Score,Percent Scoring 80 or Above,Percent Scoring Below 65
32,01M292,Orchard Collegiate Academy,High school,Algebra2/Trigonometry,2015,5,s,s,s
33,01M292,Orchard Collegiate Academy,High school,Chinese,2015,1,s,s,s
34,01M292,Orchard Collegiate Academy,High school,Common Core Algebra,2015,12,52.3,0.0,91.7

The s values look like missing data, let's replace them across our dataframe with the value `na`.

In [0]:
import numpy as np
filled_hs = None

In [0]:
filled_hs_df[:3]

,School DBN,School Name,School Level,Regents Exam,Year,Total Tested,Mean Score,Percent Scoring 80 or Above,Percent Scoring Below 65
32,01M292,Orchard Collegiate Academy,High school,Algebra2/Trigonometry,2015,5,NaN,NaN,NaN
33,01M292,Orchard Collegiate Academy,High school,Chinese,2015,1,NaN,NaN,NaN
34,01M292,Orchard Collegiate Academy,High school,Common Core Algebra,2015,12,52.3,0.0,91.7

Now let's see the nan values across all columns.

In [0]:
# write code here

# School DBN                        0
# School Name                       0
# School Level                      0
# Regents Exam                      0
# Year                              0
# Total Tested                      0
# Mean Score                     2146
# Percent Scoring 80 or Above    2146
# Percent Scoring Below 65       2146
# dtype: int64

In [0]:
filled_hs_df.shape

# (22456, 9)

(22456, 9)

It looks like 10 percent of our data is missing.

Now use numpy to remove all of the rows where the last three columns are na.

In [0]:
import numpy as np
hs_df_non_na = None

In [0]:
hs_df_non_na.shape

# (20310, 9)

(20310, 9)

Now let's check our datatypes.

In [0]:
hs_df_non_na.dtypes

# School DBN                     object
# School Name                    object
# School Level                   object
# Regents Exam                   object
# Year                            int64
# Total Tested                    int64
# Mean Score                     object
# Percent Scoring 80 or Above    object
# Percent Scoring Below 65       object
# dtype: object

School DBN                     object
School Name                    object
School Level                   object
Regents Exam                   object
Year                            int64
Total Tested                    int64
Mean Score                     object
Percent Scoring 80 or Above    object
Percent Scoring Below 65       object
dtype: object

Correct them to the appropriate types.

In [0]:
coerced_cols = None

In [0]:
coerced_cols

    Mean Score  Percent Scoring 80 or Above  Percent Scoring Below 65
34        52.3                          0.0                      91.7
35        61.5                         26.5                      44.1
36        49.2                          0.0                      90.0

In [0]:
coerced_df = None

In [0]:
coerced_df.dtypes

# School DBN                      object
# School Name                     object
# School Level                    object
# Regents Exam                    object
# Year                             int64
# Mean Score                     float64
# Percent Scoring 80 or Above    float64
# Percent Scoring Below 65       float64
# dtype: object

School DBN                      object
School Name                     object
School Level                    object
Regents Exam                    object
Year                             int64
Mean Score                     float64
Percent Scoring 80 or Above    float64
Percent Scoring Below 65       float64
dtype: object

### Using Pivot Tables

Ok, now let's see if we can use pivot tables to query some of our data.

In [0]:
hs_df_non_na[:3]

,School DBN,School Name,School Level,Regents Exam,Year,Total Tested,Mean Score,Percent Scoring 80 or Above,Percent Scoring Below 65
34,01M292,Orchard Collegiate Academy,High school,Common Core Algebra,2015,12,52.3,0.0,91.7
35,01M292,Orchard Collegiate Academy,High school,Common Core English,2015,34,61.5,26.5,44.1
36,01M292,Orchard Collegiate Academy,High school,Common Core Geometry,2015,10,49.2,0.0,90.0

Let's start by having a pivot table that displays total mean score, averaged across tests, per school, per year.

In [0]:
pivoted_mean_by_year = None

In [0]:
pivoted_mean_by_year[:3]
# 	Mean Score
# School Name	47 The American Sign Language and English Secondar	A. Philip Randolph Campus High School	ACORN Community High School	Abraham Lincoln High School	Abraham Lincoln Yabc	Academy for Careers in Television and Film	Academy for Conservation and the Environment	Academy for Environmental Leadership	Academy for Health Careers	Academy for Language and Technology	...	Westchester Square Academy	William Cullen Bryant High School	William E. Grady Career and Technical Education Hi	Williamsburg Charter High School	Williamsburg High School for Architecture and Desi	Williamsburg Preparatory School	Wings Academy	Women's Academy of Excellence	World Academy for Total Community Health High Scho	World View High School
# Year																					
# 2015	58.850000	68.207143	60.961538	62.292857	58.050000	67.600000	57.700000	59.500000	64.488889	66.191667	...	66.276923	71.975000	57.909091	61.807692	68.054545	69.978571	58.569231	65.236364	64.975000	64.000000
# 2016	56.866667	66.456250	60.445455	63.086667	58.857143	68.381818	55.258333	57.490000	60.660000	62.709091	...	65.986667	67.831250	59.118182	60.800000	68.840000	69.875000	58.100000	62.578571	62.054545	62.600000
# 2017	63.333333	67.023077	60.762500	65.690909	59.080000	68.745455

                                                    Mean Score  \
School Name 47 The American Sign Language and English Secondar
Year
2015                                                 58.850000
2016                                                 56.866667
2017                                                 63.333333

                                                                               \
School Name A. Philip Randolph Campus High School ACORN Community High School
Year
2015                                    68.207143                   60.961538
2016                                    66.456250                   60.445455
2017                                    67.023077                   60.762500

                                                              \
School Name Abraham Lincoln High School Abraham Lincoln Yabc
Year
2015                          62.292857            58.050000
2016                          63.086667            58.857143
2017                          65.690909            59.080000

                                                        \
School Name Academy for Careers in Television and Film
Year
2015                                         67.600000
2016                                         68.381818
2017                                         68.745455

                                                          \
School Name Academy for Conservation and the Environment
Year
2015                                           57.700000
2016                                           55.258333
2017                                           59.425000

                                                                             \
School Name Academy for Environmental Leadership Academy for Health Careers
Year
2015                                     59.5000                  64.488889
2016                                     57.4900                  60.660000
2017                                     60.7875                  63.785714

                                                 ...  \
School Name Academy for Language and Technology  ...
Year                                             ...
2015                                  66.191667  ...
2016                                  62.709091  ...
2017                                  61.130000  ...

                                                                          \
School Name Westchester Square Academy William Cullen Bryant High School
Year
2015                         66.276923                         71.975000
2016                         65.986667                         67.831250
2017                         65.363636                         67.345455

                                                                \
School Name William E. Grady Career and Technical Education Hi
Year
2015                                                 57.909091
2016                                                 59.118182
2017                                                 55.411111

                                              \
School Name Williamsburg Charter High School
Year
2015                               61.807692
2016                               60.800000
2017                               59.318182

                                                                \
School Name Williamsburg High School for Architecture and Desi
Year
2015                                                 68.054545
2016                                                 68.840000
2017                                                 65.370000

                                                           \
School Name Williamsburg Preparatory School Wings Academy
Year
2015                              69.978571     58.569231
2016                              69.875000     58.100000
2017                              69.427273     59.962500

                                           \
School Name Women's Academy of Excellence
Year
2015                            65.236364
2016                            62.578571
2017                            64.787500

                                                                \
School Name World Academy for Total Community Health High Scho
Year
2015                                                 64.975000
2016                                                 62.054545
2017                                                 63.377778


School Name World View High School
Year
2015                     64.000000
2016                     62.600000
2017                     62.055556

[3 rows x 459 columns]

Now let's use the `pivot_table` function to present this in the other direction.  Change the index to be the school name and the column to be the years.

In [0]:
pivoted_mean_by_school = None

In [0]:
pivoted_mean_by_school[:3]

# 	Mean Score
# Year	2015	2016	2017	2018	2019
# School Name					
# 47 The American Sign Language and English Secondar	58.850000	56.866667	63.333333	65.550000	64.500000
# A. Philip Randolph Campus High School	68.207143	66.456250	67.023077	69.208333	67.841667
# ACORN Community High School	60.961538	60.445455	60.762500	55.544444	56.985714

                                                   Mean Score             \
Year                                                     2015       2016
School Name
47 The American Sign Language and English Secondar  58.850000  56.866667
A. Philip Randolph Campus High School               68.207143  66.456250
ACORN Community High School                         60.961538  60.445455

                                                                          \
Year                                                     2017       2018
School Name
47 The American Sign Language and English Secondar  63.333333  65.550000
A. Philip Randolph Campus High School               67.023077  69.208333
ACORN Community High School                         60.762500  55.544444


Year                                                     2019
School Name
47 The American Sign Language and English Secondar  64.500000
A. Philip Randolph Campus High School               67.841667
ACORN Community High School                         56.985714

Ok, let's sort this dataframe by the top mean scores for 2019.

[To see how, look here.](https://stackoverflow.com/questions/41119623/pandas-pivot-table-sort-values-by-columns)

> `df = df_pivot.reindex(df_pivot['Value'].sort_values(by=2012, ascending=False).index)`

In [0]:
sorted_pivot_df = None

In [0]:
sorted_pivot_df[:10]

# 	Mean Score
# Year	2015	2016	2017	2018	2019
# School Name					
# Stuyvesant High School	92.186667	90.378571	90.707692	92.508333	93.166667
# The Bronx High School of Science	91.613333	90.285714	90.292308	91.400000	91.753846
# Townsend Harris High School	91.192857	90.391667	88.966667	91.945455	91.145455
# High School for Mathematics, Science and Engineeri	86.881818	86.236364	88.010000	89.070000	90.670000
# High School of American Studies at Lehman College	88.516667	88.691667	90.145455	90.260000	90.290000
# Queens High School for the Sciences at York Colleg	88.208333	88.625000	89.436364	91.109091	90.181818
# Staten Island Technical High School	89.810000	87.910000	89.411111	89.511111	89.244444
# Brooklyn Technical High School	87.668750	85.575000	84.314286	87.623077	88.630769
# Eleanor Roosevelt High School	87.100000	85.225000	85.963636	87.781818	87.781818
# Millennium High School	80.357143	82.575000	84.133333	86.470000	87.680000

                                                   Mean Score             \
Year                                                     2015       2016
School Name
Stuyvesant High School                              92.186667  90.378571
The Bronx High School of Science                    91.613333  90.285714
Townsend Harris High School                         91.192857  90.391667
High School for Mathematics, Science and Engineeri  86.881818  86.236364
High School of American Studies at Lehman College   88.516667  88.691667
Queens High School for the Sciences at York Colleg  88.208333  88.625000
Staten Island Technical High School                 89.810000  87.910000
Brooklyn Technical High School                      87.668750  85.575000
Eleanor Roosevelt High School                       87.100000  85.225000
Millennium High School                              80.357143  82.575000

                                                                          \
Year                                                     2017       2018
School Name
Stuyvesant High School                              90.707692  92.508333
The Bronx High School of Science                    90.292308  91.400000
Townsend Harris High School                         88.966667  91.945455
High School for Mathematics, Science and Engineeri  88.010000  89.070000
High School of American Studies at Lehman College   90.145455  90.260000
Queens High School for the Sciences at York Colleg  89.436364  91.109091
Staten Island Technical High School                 89.411111  89.511111
Brooklyn Technical High School                      84.314286  87.623077
Eleanor Roosevelt High School                       85.963636  87.781818
Millennium High School                              84.133333  86.470000


Year                                                     2019
School Name
Stuyvesant High School                              93.166667
The Bronx High School of Science                    91.753846
Townsend Harris High School                         91.145455
High School for Mathematics, Science and Engineeri  90.670000
High School of American Studies at Lehman College   90.290000
Queens High School for the Sciences at York Colleg  90.181818
Staten Island Technical High School                 89.244444
Brooklyn Technical High School                      88.630769
Eleanor Roosevelt High School                       87.781818
Millennium High School                              87.680000

Seems right :)

Let's select the top three, and then  plot the changes in the scores over time.  

> We may need to transpose the plot to get it to look how we like.  Also, we may need to change the size of the plot.

In [0]:
# write code here

> Answer <img src="https://github.com/jigsawlabs-student/exploring-pandas/blob/master/plotted-schools-regents.png?raw=1" width="40%">

### Bonus

Now see if you can use a pivot table to get a count of all of the students taking a regents exam per school, and produce a similar plot like we did for the average scores above.

### Summary

In this lesson we used pivot tables to group data across multiple dimensions, here a school and year, and then use an aggregate function to perform a calculation.